app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "sh@sh.com"]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "aqM6gcr-4gZfaqXG2ZfWZQ"], ["updated_at", "2015-11-18 15:35:07.191375"], ["id", 1]]
---
  def create
    user = User.find_by(email: user_params[:email])

    if user && user.authenticate(user_params[:password])

      token = SecureRandom.urlsafe_base64
      # session[:current_user_id] = user.id
      session[:session_token] = token
      user.update(session_token: token)